In [1]:
import pandas as pd
import numpy as np

### Importing Data

In [2]:
#Pulling Data From The Internet via Scraping
median_age = pd.read_html('https://en.wikipedia.org/wiki/List_of_countries_by_median_age')[0]
median_age.head()

  Country/Territory  Rank  Total(Year)  Male(Year)  Female (Year)
0       Afghanistan   208         18.8        18.8           18.9
1           Albania    95         32.9        31.6           34.3
2           Algeria   136         28.1        27.8           28.4
3    American Samoa   122         25.5        25.1           26.0
4           Andorra    10         44.3        44.4           44.1

In [3]:
#Pulling Data From the Internet via a Remote CSV
demographic_stats = pd.read_csv('https://data.cityofnewyork.us/api/views/kku6-nxdu/rows.csv')
demographic_stats.head()

,JURISDICTION NAME,COUNT PARTICIPANTS,COUNT FEMALE,PERCENT FEMALE,COUNT MALE,PERCENT MALE,COUNT GENDER UNKNOWN,PERCENT GENDER UNKNOWN,COUNT GENDER TOTAL,PERCENT GENDER TOTAL,...,COUNT CITIZEN STATUS TOTAL,PERCENT CITIZEN STATUS TOTAL,COUNT RECEIVES PUBLIC ASSISTANCE,PERCENT RECEIVES PUBLIC ASSISTANCE,COUNT NRECEIVES PUBLIC ASSISTANCE,PERCENT NRECEIVES PUBLIC ASSISTANCE,COUNT PUBLIC ASSISTANCE UNKNOWN,PERCENT PUBLIC ASSISTANCE UNKNOWN,COUNT PUBLIC ASSISTANCE TOTAL,PERCENT PUBLIC ASSISTANCE TOTAL
0,10001,44,22,0.50,22,0.50,0,0,44,100,...,44,100,20,0.45,24,0.55,0,0,44,100
1,10002,35,19,0.54,16,0.46,0,0,35,100,...,35,100,2,0.06,33,0.94,0,0,35,100
2,10003,1,1,1.00,0,0.00,0,0,1,100,...,1,100,0,0.00,1,1.00,0,0,1,100
3,10004,0,0,0.00,0,0.00,0,0,0,0,...,0,0,0,0.00,0,0.00,0,0,0,0
4,10005,2,2,1.00,0,0.00,0,0,2,100,...,2,100,0,0.00,2,1.00,0,0,2,100

In [4]:
#Pulling Data via a Local CSV
median_age = pd.read_csv('data/median_age.csv')
median_age.head()

  Country/Territory  Rank  Total(Year)  Male(Year)  Female (Year)
0       Afghanistan   208         18.8        18.8           18.9
1           Albania    95         32.9        31.6           34.3
2           Algeria   136         28.1        27.8           28.4
3    American Samoa   122         25.5        25.1           26.0
4           Andorra    10         44.3        44.4           44.1

In [5]:
#Literally copying and pasting a table to Excel or Google Sheets

In [6]:
#Manually inputting data

In [3]:
#Writing File to a CSV
#Specify Index = False to prevent the 'index' from becoming a row in the CSV
median_age.to_csv('data/median_age.csv', index=False)

### Cleaning Data

In [8]:
#See the object types for all of the column
median_age.dtypes

Country/Territory     object
Rank                   int64
Total(Year)          float64
Male(Year)           float64
Female (Year)        float64
dtype: object

In [9]:
#You can change any of the columns between float, string, and int
median_age['Rank'] = median_age['Rank'].astype('float')

In [10]:
median_age['Rank'] = median_age['Rank'].astype('str')

In [11]:
#Though it will throw an error if it can't change it. Here we can't turn a string into an integer
median_age['Rank'] = median_age['Rank'].astype('int')

ValueError: invalid literal for int() with base 10: '208.0'

In [12]:
#But we can turn a float into an integer
median_age['Rank'] = median_age['Rank'].astype('float')
median_age['Rank'] = median_age['Rank'].astype('int')

In [13]:
np.random.seed(42)
median_age['Rank'][np.random.choice(list(median_age.index), size=7)] = np.nan

/Users/evan.agovino/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

### Null Values

In [14]:
#Always check to see if any values are null
median_age.isnull().sum()

Country/Territory    0
Rank                 7
Total(Year)          0
Male(Year)           0
Female (Year)        0
dtype: int64

There are several different ways to deal with null values. 

1) If there are a significant number of null values in a column, it may not be worth considering whatsoever and may be best to disregard that column from your analysis. There isn't a go-to standard on this (that I'm aware of), but if a third to half of a column is unavailable, you should probably disregard it all together.

Below we can see that only 3% of our values for our column is null, so we can explore other options for dealing with it.

In [15]:
median_age.isnull().sum() / len(median_age)

Country/Territory    0.000000
Rank                 0.030435
Total(Year)          0.000000
Male(Year)           0.000000
Female (Year)        0.000000
dtype: float64

One way to address this is to drop null columns all together. The 'Drop NA' function will drop all rows with *any* missing values

In [16]:
median_age.dropna().head()

  Country/Territory   Rank  Total(Year)  Male(Year)  Female (Year)
0       Afghanistan  208.0         18.8        18.8           18.9
1           Albania   95.0         32.9        31.6           34.3
2           Algeria  136.0         28.1        27.8           28.4
3    American Samoa  122.0         25.5        25.1           26.0
4           Andorra   10.0         44.3        44.4           44.1

You can also drop all rows that have *all* missing values

In [17]:
median_age.dropna(how='all').head()

  Country/Territory   Rank  Total(Year)  Male(Year)  Female (Year)
0       Afghanistan  208.0         18.8        18.8           18.9
1           Albania   95.0         32.9        31.6           34.3
2           Algeria  136.0         28.1        27.8           28.4
3    American Samoa  122.0         25.5        25.1           26.0
4           Andorra   10.0         44.3        44.4           44.1

You could also fill the missing rows with the mean value of that column. You could also fill it with the mode, median, or any value that you choose.

In [18]:
median_age.fillna(median_age['Rank'].mean()).head()

  Country/Territory   Rank  Total(Year)  Male(Year)  Female (Year)
0       Afghanistan  208.0         18.8        18.8           18.9
1           Albania   95.0         32.9        31.6           34.3
2           Algeria  136.0         28.1        27.8           28.4
3    American Samoa  122.0         25.5        25.1           26.0
4           Andorra   10.0         44.3        44.4           44.1

These are all advanced techniques that are good to know, but if you have a relatively low number of null instances, you are safe removing them altogether in our case.

### Merging Datasets

Several of you asked about merging datasets. This is definitely easy to do in Pandas, but there a few things you should know going in.

Say we have two datasets - the list of median ages for different countries we found above and the list of GDPs for different countries, and we want to join the two datasets.

In [19]:
median_age.head()

  Country/Territory   Rank  Total(Year)  Male(Year)  Female (Year)
0       Afghanistan  208.0         18.8        18.8           18.9
1           Albania   95.0         32.9        31.6           34.3
2           Algeria  136.0         28.1        27.8           28.4
3    American Samoa  122.0         25.5        25.1           26.0
4           Andorra   10.0         44.3        44.4           44.1

In [20]:
gdp = pd.read_html('https://en.wikipedia.org/wiki/List_of_countries_by_GDP_(nominal)')[2]
gdp.head()

  Rank    Country/Territory GDP(US$million)
0  NaN            World[20]        84835462
1    1        United States        20513000
2    â€”  European Union[n 1]        18769286
3    2           China[n 2]        13457267
4    3                Japan         5070626

The 'pd.merge' function lets you merge two datasets on a common column. In our example, both columns will be called 'Country/Territory'.

There are five main variables you can change when you're doing a pd.merge function:

1) The first dataset  
2) The second dataset  
3) The name of the left column to merge on  
4) The name of the right column to merge on  
5) The type of merge you want to do (inner, outer, right, left)

The first four variables all make sense given the dataframes you want to merge. The fifth variable is akin to a SQL join for those who have used SQL before. For those who haven't, there are four main types of merges:

LEFT: Will preserve all columns from the first dataframe, and match any available columns from the second dataframe (any non-matching columns will have NA values)  
RIGHT: Will preserve all columns from the second dataframe, and match any available columns from the first dataframe (any non-matching columns will have NA values)  
OUTER: Will add all columns from both dataframes (any columns not present in both dataframes will have NA values)  
INNER: Will ONLY add columns available in both dataframes (No NA values if they weren't present initially)

In [21]:
pd.merge(median_age, gdp, left_on='Country/Territory', right_on='Country/Territory', how='left').tail()

,Country/Territory,Rank_x,Total(Year),Male(Year),Female (Year),Rank_y,GDP(US$million)
225,Western Sahara,183.0,21.1,20.9,21.3,NaN,NaN
226,World,115.0,30.4,29.6,31.1,NaN,NaN
227,Yemen,202.0,19.5,19.3,19.6,100,28524
228,Zambia,226.0,16.8,16.6,16.9,104,25778
229,Zimbabwe,189.0,20.0,19.6,20.4,113,19367

In [22]:
pd.merge(median_age, gdp, left_on='Country/Territory', right_on='Country/Territory', how='right').tail()

,Country/Territory,Rank_x,Total(Year),Male(Year),Female (Year),Rank_y,GDP(US$million)
188,"Gambia, The",NaN,NaN,NaN,NaN,169,1605
189,St. Kitts and Nevis,NaN,NaN,NaN,NaN,174,1005
190,St. Vincent and the Grenadines,NaN,NaN,NaN,NaN,177,828
191,SÃ£o TomÃ© and PrÃ­ncipe,NaN,NaN,NaN,NaN,181,450
192,"Micronesia, Federated States of",NaN,NaN,NaN,NaN,182,335

In [23]:
pd.merge(median_age, gdp, left_on='Country/Territory', right_on='Country/Territory', how='outer').tail()

,Country/Territory,Rank_x,Total(Year),Male(Year),Female (Year),Rank_y,GDP(US$million)
244,"Gambia, The",NaN,NaN,NaN,NaN,169,1605
245,St. Kitts and Nevis,NaN,NaN,NaN,NaN,174,1005
246,St. Vincent and the Grenadines,NaN,NaN,NaN,NaN,177,828
247,SÃ£o TomÃ© and PrÃ­ncipe,NaN,NaN,NaN,NaN,181,450
248,"Micronesia, Federated States of",NaN,NaN,NaN,NaN,182,335

In [24]:
pd.merge(median_age, gdp, left_on='Country/Territory', right_on='Country/Territory', how='inner').tail()

,Country/Territory,Rank_x,Total(Year),Male(Year),Female (Year),Rank_y,GDP(US$million)
169,Venezuela,134.0,28.3,27.6,29.0,62,96328
170,Vietnam,114.0,30.5,29.4,31.7,45,241434
171,Yemen,202.0,19.5,19.3,19.6,100,28524
172,Zambia,226.0,16.8,16.6,16.9,104,25778
173,Zimbabwe,189.0,20.0,19.6,20.4,113,19367

In our case, the data is small enough that we can manually inspect the data and see where countries aren't matching (intuitively both dataframes should fully match since they're looking at the same countries). It may be worth it to take some time and

In [25]:
outer = pd.merge(median_age, gdp, left_on='Country/Territory', right_on='Country/Territory', how='outer')

For instance, a quick view below (it doesn't let us see everything - perhaps the best way is to output this dataframe to a CSV and inspect the results in Excel or Google Sheets) shows that China, South Korea, Russia, and Syria are all labeled incorrectly in the second dataframe.

In [26]:
outer[pd.isnull(outer).any(axis=1)].tail(20)

,Country/Territory,Rank_x,Total(Year),Male(Year),Female (Year),Rank_y,GDP(US$million)
226,World,115.0,30.4,29.6,31.1,NaN,NaN
230,World[20],NaN,NaN,NaN,NaN,NaN,84835462
231,European Union[n 1],NaN,NaN,NaN,NaN,â€”,18769286
232,China[n 2],NaN,NaN,NaN,NaN,2,13457267
233,"Korea, South",NaN,NaN,NaN,NaN,11,1655608
234,Russia[n 3],NaN,NaN,NaN,NaN,12,1576488
235,Syria[n 4],NaN,NaN,NaN,NaN,69,"77,460/Na"
236,Myanmar,NaN,NaN,NaN,NaN,70,71543
237,CÃ´te d'Ivoire,NaN,NaN,NaN,NaN,84,45875
238,"Congo, Democratic Republic of the",NaN,NaN,NaN,NaN,88,42692
239,"Bahamas, The",NaN,NaN,NaN,NaN,129,12928
240,"Congo, Republic of the",NaN,NaN,NaN,NaN,135,11460
241,Eswatini,NaN,NaN,NaN,NaN,152,4756
242,Cape Verde,NaN,NaN,NaN,NaN,164,1972
243,St. Lucia,NaN,NaN,NaN,NaN,166,1774
244,"Gambia, The",NaN,NaN,NaN,NaN,169,1605
245,St. Kitts and Nevis,NaN,NaN,NaN,NaN,174,1005
246,St. Vincent and the Grenadines,NaN,NaN,NaN,NaN,177,828
247,SÃ£o TomÃ© and PrÃ­ncipe,NaN,NaN,NaN,NaN,181,450
248,"Micronesia, Federated States of",NaN,NaN,NaN,NaN,182,335

In [28]:
#Replace Values in a Given List (Using Logic of 'Where Equals to')
gdp['Country/Territory'][gdp['Country/Territory'] == 'Russia[n 3]'] = 'Russia'
gdp['Country/Territory'][gdp['Country/Territory'] == 'China[n 2]'] = 'China'
gdp['Country/Territory'][gdp['Country/Territory'] == 'Korea, South'] = 'South Korea'
gdp['Country/Territory'][gdp['Country/Territory'] == 'Syria[n 4]'] = 'Syria'

In [29]:
outer = pd.merge(median_age, gdp, left_on='Country/Territory', right_on='Country/Territory', how='outer')
outer[pd.isnull(outer).any(axis=1)].tail(20)

,Country/Territory,Rank_x,Total(Year),Male(Year),Female (Year),Rank_y,GDP(US$million)
222,Virgin Islands,44.0,41.0,39.9,41.9,NaN,NaN
223,Wallis and Futuna,104.0,32.2,31.3,33.4,NaN,NaN
224,West Bank,186.0,21.1,20.9,21.3,NaN,NaN
225,Western Sahara,183.0,21.1,20.9,21.3,NaN,NaN
226,World,115.0,30.4,29.6,31.1,NaN,NaN
230,World[20],NaN,NaN,NaN,NaN,NaN,84835462
231,European Union[n 1],NaN,NaN,NaN,NaN,â€”,18769286
232,Myanmar,NaN,NaN,NaN,NaN,70,71543
233,CÃ´te d'Ivoire,NaN,NaN,NaN,NaN,84,45875
234,"Congo, Democratic Republic of the",NaN,NaN,NaN,NaN,88,42692
235,"Bahamas, The",NaN,NaN,NaN,NaN,129,12928
236,"Congo, Republic of the",NaN,NaN,NaN,NaN,135,11460
237,Eswatini,NaN,NaN,NaN,NaN,152,4756
238,Cape Verde,NaN,NaN,NaN,NaN,164,1972
239,St. Lucia,NaN,NaN,NaN,NaN,166,1774
240,"Gambia, The",NaN,NaN,NaN,NaN,169,1605
241,St. Kitts and Nevis,NaN,NaN,NaN,NaN,174,1005
242,St. Vincent and the Grenadines,NaN,NaN,NaN,NaN,177,828
243,SÃ£o TomÃ© and PrÃ­ncipe,NaN,NaN,NaN,NaN,181,450
244,"Micronesia, Federated States of",NaN,NaN,NaN,NaN,182,335